#ให้เขียนโปรแกรมอยู่ในรูปฟังก์ชั่น
#ให้รับคะแนนจากนักศึกษา n คน แล้วทำการคำนวณและแสดงผลคะแนนเฉลี่ยโดยที่ค่า n ให้รับคะแนนจากผู้ใช้
#n คน จำนวนรับที่แน่นอน กำหนดตัวแปร sum ไว้สำหรับเก็บค่าผลรวม (ตัวแปรที่เก็บค่าผลรวมก่อนใช้งานต้องให้ค่าเริ่มต้นเป็น 0 ก่อน)

def calavgscore(n):
    
    sum_scores = 0
    
    for i in range(n):
        score = int(input(f"กรุณากรอกคะแนนของนักศึกษาคนที่ {i + 1}: "))
        sum_scores += score
    
    avgscore = sum_scores / n
    return avgscore

n = int(input("กรุณากรอกจำนวนของนักศึกษา: "))
average = calavgscore(n)
print(f"คะแนนเฉลี่ยของนักศึกษา {n} คน คือ {average}")
